<h1 align="center">Class Work</h1>

## Modifying Row/Column Indices/Labels

**```pd.DataFrame(data, index, columns, dtype=None)```**

**```pd.read_csv(fname, delimiter, header, index_col)```**
#### a. Default Behavior
#### b. Modifying While Creating Dataframe
#### c. Modifying after Dataframe is Loaded with Dataset

In [15]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [16]:
df.set_index(key='roll no')

TypeError: set_index() got an unexpected keyword argument 'key'

In [13]:
df

,roll_no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,MS01,Rauf,52,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,MS02,Arif,51,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,MS03,Shaista,35,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,MS04,Hadeed,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,MS05,Zara,40,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,MS06,Mohid,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,MS07,Zobia,40,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,MS08,Idrees,51,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,MS09,Jamil,53,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,MS10,Shahid,38,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,MS11,Khurram,35,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,MS12,Maaz,25,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,MS13,Mujahid,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,MS14,Sara,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,MS15,Fatima,33,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,MS16,Kakamanna,42,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

## Modifying Data

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

## Add a new Column in a Data Frame

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

## Add a new Row in a Data Frame

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

In [ ]:
# Let us create a new dataframe having a single row
newdf = pd.DataFrame(data=[['MS222', 100, 'Kamokey', 'AFT', 'group D', 'Male', 55.0, 55.0, 9999]],
     columns=['roll no', 'age', 'address', 'session', 'group', 'gender','subj1', 'subj2', 'scholarship'])
newdf

In [ ]:
df = df.append(newdf , ignore_index=True)
df.tail()

- Note that the due to `ignore_index=True` argument it has been assigned the next available index. Otherwise, the new row will also have row index 0.
- Moreover, note the NaN value under the scholarship column against the new added row
- One last thing, the `df.append()` method do not have `inplace` argument, so you always have to assign the resulting dataframe to the original `df`.

## Delete a Row from a Data Frame

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

## Delete a Column from a Data Frame

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

## Use of `s.map(func)` and `s/df/apply(func)` on a Column

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

## Passing a Dictionary to `s.map(dict)`

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

## Using `s.replace(dict)` instead of `s.map(dict)`

## Use of `apply(func)` on a Row or Entire Dataframe

**Example1**

In [3]:
# Since we have different dtypes in each row, so let us create a dataframe having numeric columns only
df = pd.read_csv('datasets/groupdata.csv')
df_numeric = df.loc[:,['age','subj1','subj2','scholarship']]
df_numeric

    age  subj1  subj2  scholarship
0    52   78.3   84.4       5000.0
1    51   70.5   60.5       6000.0
2    35   64.9   75.1       8500.0
3    20   82.0   84.3       4000.0
4    40   65.9   72.8       3500.0
5    16   69.3   78.6          NaN
6    40   90.2    NaN       4000.0
7    51   84.1   76.0       8000.0
8    53   90.5   81.3       3500.0
9    38   90.5   81.3       3800.0
10   35   90.5   81.3       6000.0
11   25   90.5   81.3          NaN
12   18    NaN   76.5       7000.0
13   28   84.1   76.0       8000.0
14   33   90.5   81.3       3500.0
15   42   90.5   81.3       3800.0

In [ ]:
# Although not much meaningful, let us add a number to each value of the row at index 0
df_numeric.loc[0] = df_numeric.loc[0].apply(lambda x : x+5)
df_numeric

In [ ]:
# Although not much meaningful, let us add a number to each value of the entire dataframe
df_numeric = df_numeric.apply(lambda x : x+5)
df_numeric

## Use of `applymap(func)` on a Row or Entire Dataframe

In [ ]:
# Since we have different dtypes in each row, so let us create a dataframe having strings columns only
df = pd.read_csv('datasets/groupdata.csv')
df_string = df.loc[:,['roll no','name','address','session', 'group', 'gender']]
df_string

In [ ]:
df_string.applymap(str.upper)

In [ ]:
df_numeric

In [ ]:
df_numeric.applymap(lambda x: x+5)

## Sorting Dataframe using `df.sort_values()`
>Pandas data frame has two useful functions. **`df.sort_values()`** to sort by values of one or more columns and **`df.sort_index()`** to sort by the index. Each of these functions come with numerous options, like sorting in specific order (ascending or descending), sorting in place, sorting with missing values, sorting by specific algorithm etc.
- The `df.sort_values()` function sort by the values along either axis.
```
df.sort_values(by,axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `by`: str or list of str to sort
-  `axis`: If `axis` is 0 or 'index' then 'by' may contain index levels and/or column labels. If `axis` is 1 or 'columns' then 'by' may contain column levels and/or index labels.
- `ascending`: if True then ascending and if False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1. Default False

In [ ]:
import pandas as pd
df = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Kamal', 'Saima', 'Jamal', 'Shaikh', 'Farzana'],
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 21,  23,  12,  14,  20],
    'city' : ['Lahore', 'Peshawer', 'Lahore', 'Karachi', 'Peshawer']
})
df

### a. Sorting by Single Column

In [ ]:
# Let us sort the data by grade column
# By default the sorting is done in ascending order and is not inplace
df1 = df.sort_values(by=['grade'])
df1

- Note in above output, we have sorted the data based on the `grade` column. You can observe that some of the students with higher marks are ranked lower.
- We want to sort the data based on both grades and marks.

### b. Sorting by Multiple Columns

In [ ]:
# sort the dataframe
df2 = df.sort_values(by=['grade','marks'])
df2

- Note that the data is first sorted by grade, and then within grade it is sorted by marks
- But still the problem is not solved. Actually we want to sort by grade in ascending order and by marks in descending order.

In [ ]:
df3 = df.sort_values(by=['grade','marks'], ascending=[True,False])
df3

### c. Reset the Index (if you want)
- After you sort your dataset, you can observe that the index is also shuffled according to the sorting. If we want to reset the index we use `reset_index()` function.

In [ ]:
df3.reset_index()

- Observe that now it has created another column 'index' which is the previous index. 
- If you want to remove this just pass the parameter `drop = True` and also `inplace = True` to save the state.

In [ ]:
df3.reset_index(inplace=True, drop=True)

In [ ]:
df3

### d. Role of NaN Values in Sorting

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df

In [ ]:
# If there is a missing value NaN, by default it is listed at the end when using sort_values function
# Regardless of the sorting order (Ascending or Descending)
df.sort_values(by='scholarship')

In [ ]:
# If the argument na_position='first', it will be listed at the top.
df.sort_values(by=['scholarship'], na_position='first')

>- Checkout the `df.nlargest()` method which return the first `n` rows ordered by `columns` in descending order.
>- Checkout the `df.nsmallest()` method which return the first `n` rows ordered by `columns` in ascending order.

##  Sorting dataframes using `df.sort_index()`
> We have observed while using `df.sort_values()`, by default the sorting is performed in the vertical direction. If you want to sort in the row direction, we can set the`axis` argument of  `df.sort_values()` method to 1, which is by default set to zero. However, it may cause problems when a number and a string are mixed

- So to sort a dataframe in the horizontal direction, we normally use **`df.sort_index()`** method.
```
df.sort_index(axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `axis`: The axis along which to sort. The value 0 identifies the rows, and 1 identifies the columns. (default is 0)
- `ascending`: If True then ascending and If False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1. Default False

In [ ]:
# Let us create a simple data frame
import pandas as pd
df = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 105, 103],
    'name' : ['Kamal', 'Saima', 'Jamal','Farzana', 'Shaikh'],
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 21,  23,  12,  14,  20],
    'city' : ['Lahore', 'Peshawer', 'Lahore', 'Karachi', 'Peshawer']
})
df

### a. Sort by Column Labels
- By passing the axis argument with a value 0 or 1, the sorting can be done on the column labels. By default, axis=0

In [ ]:
df1 = df.sort_index(axis=1)
df1

### b. Sort by Index
- The first question that might come in your mind, is that why do we need to sort by index. We can see in above dataframe the row indices are in numeric order. And if the row indices are disturbed due to may be sorting by the values of some column, we can use `reset_index()` method to make the row indices again in increasing numeric order.
<br><br>
- To understand this, let us follow following three steps:
    - Set the `roll_no` column as index
    - Call `sort_index()` with axis=0
    - Call `reset_index()`

In [ ]:
df

**Let us sort by roll_no**

In [ ]:
# Lets us set the roll_no column as index
df1 = df.set_index(["roll_no"])
df1

>Note that the implicit index collumn is dropped and the roll_no column has become the index of this dataframe.

In [ ]:
# sort the datframe by index 
df2 = df1.sort_index(axis=0)
df2

In [ ]:
# After sort you can reset the index if you want
df3 = df2.reset_index(drop=False)
df3